In [1]:
import pandas as pd

In [2]:
df1=pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12]],columns=['A','B','C','D'])

In [3]:
df1

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [4]:
df2=pd.DataFrame([[11,12,13,14],[25,26,27,28],[29,30,31,32]],columns=['W','X','Y','Z'])

In [5]:
df2

    W   X   Y   Z
0  11  12  13  14
1  25  26  27  28
2  29  30  31  32

In [6]:
df3=df1.merge(df2,right_on='X',left_on='B',suffixes=('_left', '_right'))

In [7]:
df3

Empty DataFrame
Columns: [A, B, C, D, W, X, Y, Z]
Index: []

In [8]:
df1

   A   B   C   D
0  1   2   3   4
1  5   6   7   8
2  9  10  11  12

In [9]:
df3

Empty DataFrame
Columns: [A, B, C, D, W, X, Y, Z]
Index: []

In [10]:
df4 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})

In [11]:
df4

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5

In [13]:
df5 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})

In [14]:
df5

  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [ ]:
=df4.merge(df5, left_on='lkey', right_on='rkey')